test_mix/fixedSphere_Re250_cfdemSolverMix/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
  (0.004 0 0)
  (0.024 0 0)
  (0.024 0.02 0)
  (0.004 0.02 0)
  (0.004 0 0.02)
  (0.024 0 0.02)
  (0.024 0.02 0.02)
  (0.004 0.02 0.02)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (90 90 90)
  simpleGrading 
  (
    (
      (0.15 0.1 0.3333)
      (0.3 0.5 1)
      (0.55 0.4 3)
    )
    (
      (0.35 0.25 0.333)
      (0.3 0.5 1)
      (0.35 0.25 3)
    )
    (
      (0.35 0.25 0.333)
      (0.3 0.5 1)
      (0.35 0.25 3)
    )
  )
);

edges
(
);

patches
(
  wall outlet
  (
    (1 2 6 5)
  )
  wall walls
  (
    (0 3 2 1)
    (4 5 6 7)
    (3 7 6 2)
    (1 5 4 0)
  )
  wall inlet
  (
    (0 4 7 3)
  )
);

mergePatchPairs
(
);
